Dlubal.SteelSurfaces.ST_METHODCOMB
Analysis Method for Load Combinations

Dlubal.SteelSurfaces.ST_METHODCOMB.ST_METHODCOMB_ENUMERATION
All possible combinations are enumerated and analyzed (in case  of many load cases very time consuming)

Dlubal.SteelSurfaces.ST_METHODCOMB.ST_METHODCOMB_ENVELOPE
Only combination possibilities of max/min basic stresses will be analyzed

Dlubal.SteelSurfaces.ST_METHODCOMB.ST_METHODCOMB_MIXED
Use Enumeration Method if less than Factor Combination Possibilities otherwise apply Envelope Methode